CanLoadFamilies Method
 Checks whether the document is in a state that allows the loading of families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public static bool CanLoadFamilies(
	Document document
)
Visual Basic
Public Shared Function CanLoadFamilies ( _
	document As Document _
) As Boolean
Visual C++
public:
static bool CanLoadFamilies(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DBDocument
 The document to check.
Return Value
 True if loading of families is allowed, otherwise False.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Family Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →